cases/07_compressionExpansionVariableProperties/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version: 13
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Las coordenadas se introducen en milímetros
convertToMeters 0.001;

// Motor CFR simplificado:
// Diámetro: 82.55 mm
// Radio: 41.275 mm
// Carrera: 114.30 mm
// Altura de cámara en PMS: 12.70 mm
// Altura total en PMI: 127.00 mm
//
// Modelo axisimétrico con sector de 5 grados:
// +2.5 grados y -2.5 grados respecto al plano central.

vertices
(
    // Pistón, z = 0 mm
    (0          0          0)       // 0: eje
    (41.235715  1.800390   0)       // 1: radio, wedge frontal
    (41.235715 -1.800390   0)       // 2: radio, wedge posterior

    // Culata, z = 127 mm
    (0          0          127)     // 3: eje
    (41.235715  1.800390   127)     // 4: radio, wedge frontal
    (41.235715 -1.800390   127)     // 5: radio, wedge posterior
);

blocks
(
    // 40 celdas radiales
    // 1 celda angular
    // 120 celdas axiales
    hex (0 2 1 0 3 5 4 3) (40 1 120) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    piston
    {
        type wall;
        faces
        (
            (0 2 1 0)
        );
    }

    cylinderHead
    {
        type wall;
        faces
        (
            (3 4 5 3)
        );
    }

    cylinderWall
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }

    wedgeFront
    {
        type wedge;
        faces
        (
            (0 1 4 3)
        );
    }

    wedgeBack
    {
        type wedge;
        faces
        (
            (0 2 5 3)
        );
    }

    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
