cases/07_compressionExpansionVariableProperties/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
4800
(
(-7.9038272e-05 3.8983656e-11 0.088773609)
(-4.7899265e-05 -1.82622e-10 0.088717938)
(9.9451745e-05 -5.1403723e-12 0.088694785)
(0.00017402855 -2.8224476e-12 0.088705462)
(0.00021933356 5.9200599e-12 0.088713712)
(0.0002470009 9.8447835e-12 0.088718277)
(0.00026053229 1.0890742e-12 0.088724742)
(0.00025365816 -4.5309295e-12 0.088731957)
...
)
;

boundaryField
{
    piston
    {
        type            movingWallVelocity;
        value           nonuniform List<vector>
40
(
(0 0 0.0038386578)
(0 0 0.0038386578)
(0 0 0.0038386578)
(0 0 0.0038386578)
(0 0 0.0038386578)
(0 0 0.0038386578)
(0 0 0.0038386578)
(0 0 0.0038386578)
...
)
;
    }
    cylinderHead
    {
        type            noSlip;
    }
    cylinderWall
    {
        type            noSlip;
    }
    wedgeFront
    {
        type            wedge;
    }
    wedgeBack
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
