cases/07_compressionExpansionVariableProperties/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar>
4800
(
2465437.2
2465437.2
2465437.2
2465437.2
2465437.2
2465437.2
2465437.2
2465437.2
...
)
;

boundaryField
{
    piston
    {
        type            zeroGradient;
    }
    cylinderHead
    {
        type            zeroGradient;
    }
    cylinderWall
    {
        type            zeroGradient;
    }
    wedgeFront
    {
        type            wedge;
    }
    wedgeBack
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
