cases/07_compressionExpansionVariableProperties/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar>
4800
(
566.10601
566.14069
566.14841
566.14939
566.15327
566.15968
566.1658
566.17402
...
)
;

boundaryField
{
    piston
    {
        type            fixedValue;
        value           uniform 485.2;
    }
    cylinderHead
    {
        type            fixedValue;
        value           uniform 525.2;
    }
    cylinderWall
    {
        type            fixedValue;
        value           uniform 430.1;
    }
    wedgeFront
    {
        type            wedge;
    }
    wedgeBack
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
