cases/07_compressionExpansionVariableProperties/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   nonuniform List<scalar>
9440
(
-9.4227286e-12
-5.984777e-10
5.8522631e-12
-1.8428159e-09
5.7501965e-11
-3.0995885e-09
1.1382831e-10
-4.3225223e-09
...
)
;

boundaryField
{
    piston
    {
        type            calculated;
        value           uniform 0;
    }
    cylinderHead
    {
        type            calculated;
        value           uniform 0;
    }
    cylinderWall
    {
        type            calculated;
        value           uniform 0;
    }
    wedgeFront
    {
        type            wedge;
        value           nonuniform List<scalar>
4800
(
6.4578343e-17
-9.8892821e-17
-2.1442972e-16
-3.7127196e-16
-4.1773887e-16
-3.6690083e-16
-2.3935284e-16
-2.5437671e-16
...
)
;
    }
    wedgeBack
    {
        type            wedge;
        value           nonuniform List<scalar>
4800
(
-6.4578142e-17
9.8893069e-17
2.1442977e-16
3.7127178e-16
4.1773889e-16
3.6690058e-16
2.3935291e-16
2.543765e-16
...
)
;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
