cases/07_compressionExpansionVariableProperties/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar>
4800
(
15.168907
15.167978
15.167771
15.167745
15.167641
15.167469
15.167305
15.167085
...
)
;

boundaryField
{
    piston
    {
        type            calculated;
        value           nonuniform List<scalar>
40
(
17.698288
17.698288
17.698288
17.698288
17.698288
17.698288
17.698288
17.698289
...
)
;
    }
    cylinderHead
    {
        type            calculated;
        value           nonuniform List<scalar>
40
(
16.350499
16.350499
16.350499
16.350499
16.350499
16.350499
16.350499
16.350499
...
)
;
    }
    cylinderWall
    {
        type            calculated;
        value           nonuniform List<scalar>
120
(
19.965643
19.965645
19.965647
19.965648
19.965649
19.96565
19.965651
19.965651
...
)
;
    }
    wedgeFront
    {
        type            wedge;
    }
    wedgeBack
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
