cases/07_compressionExpansionVariableProperties/0/rhoUf
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceVectorField;
    location    "0";
    object      rhoUf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -2 -1 0 0 0 0];

internalField   nonuniform List<vector>
9440
(
(-0.00098904855 -6.6916526e-10 1.3462511)
(-0.0017537038 -1.5710839e-10 0.04031786)
(0.00030713887 -1.5463526e-09 1.3455038)
(-0.0012887687 -4.0606927e-09 0.039976149)
(0.0020118813 -6.1403246e-11 1.3453774)
(0.0016559686 -1.6204772e-10 0.039854589)
(0.0029869725 2.0670238e-11 1.3455173)
(0.0030731254 -6.9276649e-11 0.039906051)
...
)
;

boundaryField
{
    piston
    {
        type            calculated;
        value           nonuniform List<vector>
40
(
(0 0 0.067937673)
(0 0 0.067937673)
(0 0 0.067937673)
(0 0 0.067937673)
(0 0 0.067937673)
(0 0 0.067937673)
(0 0 0.067937673)
(0 0 0.067937673)
...
)
;
    }
    cylinderHead
    {
        type            calculated;
        value           uniform (-0 0 0);
    }
    cylinderWall
    {
        type            calculated;
        value           nonuniform List<vector>
120
(
(1.6624877e-12 0 0)
(1.3958155e-17 0 0)
(1.662488e-12 0 0)
(1.3958157e-17 0 0)
(-1.6624742e-12 0 0)
(1.3958158e-17 0 0)
(1.3958159e-17 0 0)
(0 0 0)
...
)
;
    }
    wedgeFront
    {
        type            wedge;
        value           nonuniform List<vector>
4800
(
(-0.0011977831 -5.2295743e-05 1.3465987)
(-0.0023062861 -0.00010069552 -0.76952215)
(-0.0029020228 -0.000126707 0.42402131)
(-0.0029473927 -0.00012868933 -0.18773659)
(-0.0024798332 -0.00010827567 0.023704289)
(-0.0017667108 -7.7139616e-05 -0.023921374)
(-0.0010219849 -4.4623013e-05 -0.024518851)
(-0.00039344363 -1.7180449e-05 -0.019114685)
...
)
;
    }
    wedgeBack
    {
        type            wedge;
        value           nonuniform List<vector>
4800
(
(-0.0011977831 5.2296925e-05 1.3465987)
(-0.0023062862 0.00010069371 -0.76952215)
(-0.002902023 0.00012670308 0.42402131)
(-0.002947393 0.00012868254 -0.18773659)
(-0.0024798336 0.00010826803 0.023704289)
(-0.0017667111 7.7132903e-05 -0.023921374)
(-0.0010219851 4.4618634e-05 -0.024518851)
(-0.00039344383 1.7175795e-05 -0.019114685)
...
)
;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
