cases/07_compressionExpansionVariableProperties/0/wallHeatFlux
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallHeatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    piston
    {
        type            calculated;
        value           nonuniform List<scalar>
40
(
-62705.187
-62732.343
-62738.388
-62739.155
-62742.193
-62747.213
-62752.005
-62758.441
...
)
;
    }
    cylinderHead
    {
        type            calculated;
        value           nonuniform List<scalar>
40
(
-54280.775
-54284.336
-54286.454
-54286.421
-54285.228
-54284.728
-54285.287
-54285.512
...
)
;
    }
    cylinderWall
    {
        type            calculated;
        value           nonuniform List<scalar>
120
(
-16011.599
-22631.361
-23834.754
-23977.001
-23979.486
-23966.291
-23953.793
-23942.43
...
)
;
    }
    wedgeFront
    {
        type            wedge;
    }
    wedgeBack
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
