cases/07_compressionExpansionVariableProperties/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version: 13
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                                 none;

    // Cantidad de movimiento
    div(phi,U)                              Gauss upwind;

    // Energía interna sensible
    div(phi,e)                              Gauss upwind;

    // Energía cinética
    div(phi,K)                              Gauss limitedLinear 1;

    // Transporte de presión y densidad
    div(phi,(p|rho))                        Gauss limitedLinear 1;

    // Término viscoso
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
